## iterrows
Opprett en DataFrame med komplekse data

In [1]:
import pandas as pd

# Oppretter DataFrame
data = {'Navn': ['Per', 'Kari', 'Ola'],
        'Telefon': [{'hjemme': '12345678', 'mobil': '99887766'},
                    {'hjemme': '87654321', 'mobil': '11223344'},
                    {'hjemme': '56789012', 'mobil': '44332211'}]}

df = pd.DataFrame(data)
display(df)

   Navn                                      Telefon
0   Per  {'hjemme': '12345678', 'mobil': '99887766'}
1  Kari  {'hjemme': '87654321', 'mobil': '11223344'}
2   Ola  {'hjemme': '56789012', 'mobil': '44332211'}

Lag nye kolonner

In [2]:
df['Hjemme'] = ''
df['Mobil'] = ''
display(df)

   Navn                                      Telefon Hjemme Mobil
0   Per  {'hjemme': '12345678', 'mobil': '99887766'}
1  Kari  {'hjemme': '87654321', 'mobil': '11223344'}
2   Ola  {'hjemme': '56789012', 'mobil': '44332211'}

Bruk iterrows til å henet telefonnumrene  
Legg de inn i respektive kolonner  
Slett til slutt den opprinnelige kolonnen

In [3]:
for index, row in df.iterrows():
    hjemme = row['Telefon']['hjemme']
    df.at[index, 'Hjemme'] = hjemme
    mobil = row['Telefon']['mobil']
    df.at[index, 'Mobil'] = mobil

df.drop('Telefon', axis=1, inplace=True)
display(df)

   Navn    Hjemme     Mobil
0   Per  12345678  99887766
1  Kari  87654321  11223344
2   Ola  56789012  44332211

Smidig IT-2 © TIP AS, 2024